fixtures/payments_transaction.json

{
  "transaction": {
    "id": 699519475,
    "type": "debit",
    "test": false,
    "payout_id": 623721858,
    "payout_status": "paid",
    "currency": "USD",
    "amount": "-50.00",
    "fee": "0.00",
    "net": "-50.00",
    "source_id": 460709370,
    "source_type": "adjustment",
    "source_order_id": 0,
    "source_order_transaction_id": 0,
    "processed_at": "2013-11-01"
  }
}